Revit 2026 API

# IFCExternalServiceUIData Class

---

UI data wrapper for IFCExternalServiceUIData.

SystemObject Autodesk.Revit.UIIFCExternalServiceUIData

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class IFCExternalServiceUIData : IDisposable
```
```vb
Public Class IFCExternalServiceUIData
	Implements IDisposable
```
```cpp
public ref class IFCExternalServiceUIData : IDisposable
```
```fsharp
type IFCExternalServiceUIData =
    class
        interface IDisposable
    end
```

The IFCExternalServiceUIData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Document | return the document |
|  | IsReset | flag to indicate the value has been reset |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | ParamId | the parameter id |
|  | SelectedIFCItem | The selected IFC Item (can be IFC Entity, or PredefinedType) |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the IFCExternalServiceUIData |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetParentHwnd | return the parent handle |
|  | GetRevitElementIds | return the list of revit Element Ids |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.UI Namespace